In [1]:
#!wget https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

# Import pandas using its alias
import pandas as pd

# Create the DataFrame object
titanic_df = pd.read_csv("titanic.csv")

In [2]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
titanic_df['Fare_Double'] = titanic_df['Fare'].apply(lambda x: x * 2)


class_mapping = {1: 'First', 2: 'Second', 3: 'Third'}
titanic_df['Class_Category'] = titanic_df['Pclass'].map(class_mapping)


titanic_transformed=titanic_df.select_dtypes(include=['number']).applymap(lambda x: x ** 2)


print("\nModified Titanic Dataset:")
print(titanic_df[['Fare', 'Fare_Double', 'Pclass', 'Class_Category']].head())
print("\nTransformed Titanic Dataset (Numerical Values Squared):")
print(titanic_transformed[['Fare', 'Fare_Double', 'Pclass']].head())

Modified Titanic Dataset:
      Fare  Fare_Double  Pclass Class_Category
0   7.2500      14.5000       3          Third
1  71.2833     142.5666       1          First
2   7.9250      15.8500       3          Third
3  53.1000     106.2000       1          First
4   8.0500      16.1000       3          Third

Transformed Titanic Dataset (Numerical Values Squared):
          Fare   Fare_Double  Pclass
0    52.562500    210.250000       9
1  5081.308859  20325.235436       1
2    62.805625    251.222500       9
3  2819.610000  11278.440000       1
4    64.802500    259.210000       9

C:\Users\YASSINE\AppData\Local\Temp\ipykernel_12648\263810533.py:8: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  titanic_transformed=titanic_df.select_dtypes(include=['number']).applymap(lambda x: x ** 2)

In [11]:

cabins_data = {
    'PassengerId': [1, 2, 3, 4, 5],
    'Cabin': ['C123', 'E456', 'C123', 'G789', 'D101']
}

cabins_df = pd.DataFrame(cabins_data)


print("\nCabins DataFrame:")
print(cabins_df)

Cabins DataFrame:
   PassengerId Cabin
0            1  C123
1            2  E456
2            3  C123
3            4  G789
4            5  D101

In [12]:

titanic_cabins = pd.merge(titanic_df, cabins_df, on='PassengerId')



titanic_cabins.shape

(5, 15)

In [13]:
titanic_cabins.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin_x,Embarked,Fare_Double,Class_Category,Cabin_y
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,14.5000,Third,C123
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,142.5666,First,E456
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,15.8500,Third,C123
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,106.2000,First,G789
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,16.1000,Third,D101

In [14]:
import pandas as pd


df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value_left': [1, 2, 3, 4]})

df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value_right': [5, 6, 7, 8]})


left_join_result = pd.merge(df1, df2, on='key', how='left')


right_join_result = pd.merge(df1, df2, on='key', how='right')

print("Left Join Result:")
print(left_join_result)

print("\nRight Join Result:")
print(right_join_result)

Left Join Result:
  key  value_left  value_right
0   A           1          NaN
1   B           2          5.0
2   C           3          NaN
3   D           4          6.0

Right Join Result:
  key  value_left  value_right
0   B         2.0            5
1   D         4.0            6
2   E         NaN            7
3   F         NaN            8

In [15]:

titanic_full = pd.merge(titanic_cabins, titanic_df, left_on='PassengerId', right_on='PassengerId', suffixes=('_cabins', '_original'))


print("\nJoined DataFrame (titanic_full):")
print(titanic_full.head())

Joined DataFrame (titanic_full):
   PassengerId  Survived_cabins  Pclass_cabins  \
0            1                0              3
1            2                1              1
2            3                1              3
3            4                1              1
4            5                0              3

                                         Name_cabins Sex_cabins  Age_cabins  \
0                            Braund, Mr. Owen Harris       male        22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     female        38.0
2                             Heikkinen, Miss. Laina     female        26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     female        35.0
4                           Allen, Mr. William Henry       male        35.0

   SibSp_cabins  Parch_cabins     Ticket_cabins  Fare_cabins  ...  \
0             1             0         A/5 21171       7.2500  ...
1             1             0          PC 17599      71.2833  ...
2             0             0  STON/O2. 3101282       7.9250  ...
3             1             0            113803      53.1000  ...
4             0             0            373450       8.0500  ...

  Sex_original Age_original  SibSp_original Parch_original   Ticket_original  \
0         male         22.0               1              0         A/5 21171
1       female         38.0               1              0          PC 17599
2       female         26.0               0              0  STON/O2. 3101282
3       female         35.0               1              0            113803
4         male         35.0               0              0            373450

   Fare_original  Cabin Embarked_original Fare_Double_original  \
0         7.2500    NaN                 S              14.5000
1        71.2833    C85                 C             142.5666
2         7.9250    NaN                 S              15.8500
3        53.1000   C123                 S             106.2000
4         8.0500    NaN                 S              16.1000

   Class_Category_original
0                    Third
1                    First
2                    Third
3                    First
4                    Third

[5 rows x 28 columns]